# pandas

In [4]:
import pandas as pd
import numpy as np

dict = {
    'country':['Brazil','Russia','India','China','South Africa'],
    'capital':['Brasilia','Moscow','New Delhi','Beijing','Pretoria'],
    'area': [8.516,17.10,3.286,9.455,1.22],
    'population': [200.4,152.3,1233,23.34,233]
}
brics =pd.DataFrame(dict, index = ['Br','Ru','In','Ch','Sa'])
#brics.index = ['Br','Ru', 'In','Ch','Sa']
print(brics)

         country    capital    area  population
Br        Brazil   Brasilia   8.516      200.40
Ru        Russia     Moscow  17.100      152.30
In         India  New Delhi   3.286     1233.00
Ch         China    Beijing   9.455       23.34
Sa  South Africa   Pretoria   1.220      233.00

## Series

In [6]:
labels = ['a','b','c']
my_data =[10,0,30]
arr = np.array(my_data)
d = {'a':10,'b':0,'c':30}

In [7]:
pd.Series(data=my_data)

0    10
1     0
2    30
dtype: int64

In [8]:
pd.Series(data=my_data,index=labels)

a    10
b     0
c    30
dtype: int64

In [9]:
pd.Series(my_data,labels)

a    10
b     0
c    30
dtype: int64

In [10]:
pd.Series(d)

a    10
b     0
c    30
dtype: int64

In [11]:
pd.Series(arr)

0    10
1     0
2    30
dtype: int64

In [12]:
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [13]:
ser1 = pd.Series([1,2,3,4],['USA','USSR','JPN','GER'])

In [14]:
ser2 = pd.Series([1,2,5,4],['USA','Germany', 'Italy','Japan'])

In [15]:
ser2['USA']

1

In [16]:
ser3 = pd.Series(data=labels)

In [17]:
ser1 + ser2

GER        NaN
Germany    NaN
Italy      NaN
JPN        NaN
Japan      NaN
USA        2.0
USSR       NaN
dtype: float64

## dataframes

In [18]:
from numpy.random import randn
np.random.seed(101)

In [19]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [21]:
df['new'] = df['W'] + df['X']
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [29]:
df.drop('new',axis=1)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [23]:
df.loc['A']

W      2.706850
X      0.628133
Y      0.907969
Z      0.503826
new    3.334983
Name: A, dtype: float64

In [24]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
D  0.188695 -0.758872 -0.933237  0.955057 -0.570177
E  0.190794  1.978757  2.605967  0.683509  2.169552

In [25]:
df.iloc[0]

W      2.706850
X      0.628133
Y      0.907969
Z      0.503826
new    3.334983
Name: A, dtype: float64

In [26]:
df.loc['A','X']

0.6281327087844596

In [28]:
df.loc[['A','B'],['W','Y']]

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077